const data = [
  ['Категория', 'Продажи', 'Выручка в сред.', 'Выручка', 'Остатки', 'Стоимость остатоков'],
  ['Мягкие игрушки', '542500 шт.', '800 млрд.', '600 млрд.', '6504566 шт.', '256 млрд.'],
  ['Мягкие игрушки', '542500 шт.', '800 млрд.', '600 млрд.', '6504566 шт.', '256 млрд.'],
  ['Мягкие игрушки', '542500 шт.', '800 млрд.', '600 млрд.', '6504566 шт.', '256 млрд.'],
  ['Мягкие игрушки', '542500 шт.', '800 млрд.', '600 млрд.', '6504566 шт.', '256 млрд.'],
  ['Мягкие игрушки', '542500 шт.', '800 млрд.', '600 млрд.', '6504566 шт.', '256 млрд.'],
];

const testWrapper = document.querySelector('.test-table');

if (testWrapper) {
  renderTable();

  function renderTable() {
    testWrapper.innerHTML = `
                        <tr class="table__header">
                          ${data[0].map(el => `<th>${el}</th>`)}
                        </tr>
                        ${data.map((arr, i) => i !== 0 ? `<tr>${arr.map(el => `<td>${el}</td>`)}</tr>` : null)}
  `;
  }
}
